{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "directionality": "bidi",
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "3C\u6570\u7801",
    "1": "\u4e2a\u62a4",
    "2": "\u4e66\u7c4d",
    "3": "\u4e73\u54c1",
    "4": "\u4f11\u95f2\u98df\u54c1",
    "5": "\u5065\u5eb7",
    "6": "\u5065\u5eb7\u98df\u54c1",
    "7": "\u529e\u516c",
    "8": "\u5ba0\u7269",
    "9": "\u5bb6\u5c45",
    "10": "\u5bb6\u7535",
    "11": "\u670d\u9970\u5185\u8863",
    "12": "\u6bcd\u5a74",
    "13": "\u6c34\u4ea7",
    "14": "\u6c34\u679c",
    "15": "\u6c7d\u8f66\u7528\u54c1",
    "16": "\u6e05\u6d01",
    "17": "\u73a9\u5177",
    "18": "\u793c\u54c1",
    "19": "\u7cae\u6cb9\u901f\u98df",
    "20": "\u7f8e\u5986",
    "21": "\u8089\u79bd\u86cb",
    "22": "\u852c\u83dc",
    "23": "\u8fd0\u52a8",
    "24": "\u9152\u996e\u51b2\u8c03",
    "25": "\u949f\u8868\u914d\u9970",
    "26": "\u978b\u9774\u7bb1\u5305",
    "27": "\u9910\u996e",
    "28": "\u9999\u70df",
    "29": "\u9c9c\u82b1\u7eff\u690d"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "3C\u6570\u7801": 0,
    "\u4e2a\u62a4": 1,
    "\u4e66\u7c4d": 2,
    "\u4e73\u54c1": 3,
    "\u4f11\u95f2\u98df\u54c1": 4,
    "\u5065\u5eb7": 5,
    "\u5065\u5eb7\u98df\u54c1": 6,
    "\u529e\u516c": 7,
    "\u5ba0\u7269": 8,
    "\u5bb6\u5c45": 9,
    "\u5bb6\u7535": 10,
    "\u670d\u9970\u5185\u8863": 11,
    "\u6bcd\u5a74": 12,
    "\u6c34\u4ea7": 13,
    "\u6c34\u679c": 14,
    "\u6c7d\u8f66\u7528\u54c1": 15,
    "\u6e05\u6d01": 16,
    "\u73a9\u5177": 17,
    "\u793c\u54c1": 18,
    "\u7cae\u6cb9\u901f\u98df": 19,
    "\u7f8e\u5986": 20,
    "\u8089\u79bd\u86cb": 21,
    "\u852c\u83dc": 22,
    "\u8fd0\u52a8": 23,
    "\u9152\u996e\u51b2\u8c03": 24,
    "\u949f\u8868\u914d\u9970": 25,
    "\u978b\u9774\u7bb1\u5305": 26,
    "\u9910\u996e": 27,
    "\u9999\u70df": 28,
    "\u9c9c\u82b1\u7eff\u690d": 29
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 21128
}
